package com.eduscope.eduscope.tests;

import java.util.ArrayList;
import java.util.List;

public class QuestionBankAllTopics {

    private static List<QuestionList> questions_ticket1() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "По мнению идеалистов, первоосновой всего является...",
                "Материя",
                "Мысль",
                "Сознание, порождающее собственное видение реальности",
                "Дух, который порождает материю, т.е. весь природный мир",
                "Дух, который порождает материю, т.е. весь природный мир",
                "");
        final QuestionList question2 = new QuestionList(
                "Идеалом Возрождения является...",
                "Человек, уподобленный Богу",
                "Уравновешенный духовно и телесно человек",
                "Максимально преисполневшийся духовно человек",
                "Человек, с отдельным духовным и телесным началом",
                "Уравновешенный духовно и телесно человек",
                "");
        final QuestionList question3 = new QuestionList(
                "Человека Кант считает жителем 2-х миров: ...",
                "Чувственного и мира разума",
                "Теоретического и практического",
                "Постигнутого и непостигнутого",
                "Постижимого и непостижимого",
                "Чувственного и мира разума",
                "");
        final QuestionList question4 = new QuestionList(
                "Основоположником идей иррационализма является...",
                "Артур Шопенгауэр",
                "Макс Шелер",
                "Макс Хоркхаймер",
                "Эдмунд Гуссерль",
                "Артур Шопенгауэр",
                "");
        final QuestionList question5 = new QuestionList(
                "Термин \"Соборность\" означает...",
                "Взгляд на Запад как на пример",
                "Отвержение западного эгоизма",
                "Ущемление личностного начала",
                "Разумность, искренность, единение людей",
                "Разумность, искренность, единение людей",
                "");
        final QuestionList question6 = new QuestionList(
                "Что из нижеперечисленного является видом идеализма?",
                "Античный",
                "Современный",
                "Субъективный",
                "Относительный",
                "Субъективный",
                "");
        final QuestionList question7 = new QuestionList(
                "Теория о развитии природы согласно плану, а не случайно, впервые была упомянута еще в Новое время философом...",
                "Георгом Гегелем",
                "Томасом Гоббсом",
                "Фрэнсисом Бэконом",
                "Дэвидом Юмом",
                "Георгом Гегелем",
                "");
        final QuestionList question8 = new QuestionList(
                "Какова связь между понятиями \"сознание\" и \"психика\"?",
                "Психика - регулятор неосознаваемого поведения",
                "Психика - регулятор осознанного поведения",
                "Понятия тождественны",
                "Психика относится только к человеку",
                "Психика - регулятор неосознаваемого поведения",
                "");
        final QuestionList question9 = new QuestionList(
                "Что из перечисленного не относится к теоретическому уровню научного познания?",
                "Формулирование законов",
                "Процедура объяснения",
                "Наблюдение",
                "Процедура обобщения",
                "Наблюдение",
                "");
        final QuestionList question10 = new QuestionList(
                "К какой сфере общественной жизни относятся общественные организации?",
                "Духовная",
                "Социальная",
                "Экономическая",
                "Политическая",
                "Политическая",
                "");

        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket2() {

        final List<QuestionList> questionList = new ArrayList<>();
        final QuestionList question1 = new QuestionList(
                "Цель обеспечить социальный порядок, мир и стабильность в обществе на основе принципов морали в рамках учения преследовал...",
                "Лао Цзы",
                "Платон",
                "Аристотель",
                "Конфуций",
                "Конфуций",
                "");
        final QuestionList question2 = new QuestionList(
                "Что является главным методом исследований в философии Нового времени?",
                "Эксперимент",
                "Логический вывод, основанный на опыте",
                "Оправдание явлений через религию",
                "Логический вывод, берущий начало в предположении",
                "Эксперимент",
                "");
        final QuestionList question3 = new QuestionList(
                "Главный критерий истины в учении Маркса - это...",
                "Практика",
                "Логический вывод",
                "Поддержка общества",
                "Противопоставление естественным процессам",
                "Практика",
                "");
        final QuestionList question4 = new QuestionList(
                "Изначальной целью направления позитивизма являлась абстракция от...",
                "Религиозных суждений",
                "Суждений философов прошлых эпох",
                "Логических суждений",
                "Метафизических суждений",
                "Метафизических суждений",
                "");
        final QuestionList question5 = new QuestionList(
                "Эпоха вольнодумства на белорусской земле заканчивается с...",
                "Контрреформацией и образованием РП",
                "Запретом белорусского языка",
                "Присоединением к Российской империи",
                "Поиском белорусской идентичности",
                "Контрреформацией и образованием РП",
                "");
        final QuestionList question6 = new QuestionList(
                "Какой из подходов в истории понятия материи является самым древним?",
                "Субстратный",
                "Античный",
                "Гносеологический",
                "Атрибутивный",
                "Субстратный",
                "");
        final QuestionList question7 = new QuestionList(
                "К какому этапу классической западноевропейской философии относится суждение, что человек - творение Бога?",
                "Античность",
                "Средневековье",
                "Новое время",
                "Возрождение",
                "Средневековье",
                "");
        final QuestionList question8 = new QuestionList(
                "Раздел философии, изучающий проблемы познания называется...",
                "Социальная философия",
                "Философская антропология",
                "Онтология",
                "Гносеология",
                "Гносеология",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой характеристике человеческого общества относится утверждение о способности постановки задач совместной детельности?",
                "Динамичность",
                "Целостность",
                "Институциональность",
                "Самоорганизуемость",
                "Самоорганизуемость",
                "");
        final QuestionList question10 = new QuestionList(
                "\"Период воюющих царств\" в Китае стал для философии...",
                "Кризисом",
                "Периодом развития в условиях ограничений",
                "Золотым веком",
                "Период воюющих царств не повлиял на развитие философии",
                "Золотым веком",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket3() {

        final List<QuestionList> questionList = new ArrayList<>();
        final QuestionList question1 = new QuestionList(
                "Философско-исторический раздел философии изучает...",
                "Смысл исторического процесса",
                "Философские учения различных авторов разных эпох",
                "Человеческий быт в рамках разных эпох",
                "Историческое развитие философии",
                "Смысл исторического процесса",
                "");
        final QuestionList question2 = new QuestionList(
                "Направление, при котором уже не Бог, а природа оказывается в центре внимания философии называется...",
                "Натурфилософия",
                "Пантеизм",
                "Гуманизм",
                "Идеализм",
                "Натурфилософия",
                "");
        final QuestionList question3 = new QuestionList(
                "Теорию происхождения мира из газо-пылевой туманности была разработал...",
                "Иммануил Кант",
                "Фридрих Вильгельм Йозеф фон Шеллинг",
                "Иоганн Готлиб Фихте",
                "Георг Вильгельм Фридрих Гегель",
                "Иммануил Кант",
                "");
        final QuestionList question4 = new QuestionList(
                "Основываясь на буддийской философии, Шопенгауэр уделял значительное внимание понятию...",
                "Удовольствия",
                "Страдания",
                "Лени",
                "Иллюзии",
                "Страдания",
                "");
        final QuestionList question5 = new QuestionList(
                "В рамках русского космизма впервые выдвигается идея об...",
                "Ответственности даже за судьбу космоса",
                "Ответственности каждого за судьбу общества",
                "Ответственности каждого за свою судьбу",
                "Ответственности каждого за судьбу ближнего",
                "Ответственности даже за судьбу космоса",
                "");
        final QuestionList question6 = new QuestionList(
                "Как называется первый этап развития онтологии?",
                "Античный",
                "Древний",
                "Средневековый",
                "Древнегреческий",
                "Античный",
                "");
        final QuestionList question7 = new QuestionList(
                "Концепция коэволюции в философии природы означает...",
                "Совместное развитие природы и человека",
                "Сокращение производства в целях экологии",
                "Объединение стран для оптимизации производства",
                "Ускоренное развитие эко-технологий",
                "Совместное развитие природы и человека",
                "");
        final QuestionList question8 = new QuestionList(
                "Какая стадия истории философии является крайней в интерпретации феномена сознания?",
                "Эпоха возрождения",
                "Новое время",
                "Современная философия",
                "Постклассическая философия",
                "Постклассическая философия",
                "");
        final QuestionList question9 = new QuestionList(
                "Какая существует связь между теоретическими и эмпирическими уровнями познания?",
                "Теоретические знания обширнее эмпирических",
                "Знание не может быть подкреплено только теорией",
                "Теоретическое познание старше эмпирического в истории",
                "Эмпирическое знание не может возникнуть без теоретического",
                "Теоретические знания обширнее эмпирических",
                "");
        final QuestionList question10 = new QuestionList(
                "К какой сфере общественной жизни относится образование?",
                "Духовная (культурная)",
                "Экономическая",
                "Политическая",
                "Социальная",
                "Духовная (культурная)",
                "");



        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket4() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Определяющее значение действий людей, а не богов было предложено...",
                "Индийской философией",
                "Греческой философией",
                "Китайской философией",
                "Индийской философией",
                "Китайской философией",
                "");
        final QuestionList question2 = new QuestionList(
                "На что направлен основной исследовательский интерес философов Нового времени?",
                "Философское обоснование научного познания",
                "Смысл бытия",
                "Поиск гармонии в природе",
                "Противоречия в религии",
                "Философское обоснование научного познания",
                "");
        final QuestionList question3 = new QuestionList(
                "По мнению Маркса, базисом общества является...",
                "Духовность",
                "Нравственность",
                "Государственное управление",
                "Экономика",
                "Экономика",
                "");
        final QuestionList question4 = new QuestionList(
                "Основоположником какой современной науки является Огюст Конт?",
                "Естествознания",
                "Социологии",
                "Искусствознания",
                "Экономики",
                "Социологии",
                "");
        final QuestionList question5 = new QuestionList(
                "Белорусская философия изучает человека с позиции...",
                "Идеализма",
                "Материализма",
                "Гуманизма",
                "Агностицизма",
                "Гуманизма",
                "");
        final QuestionList question6 = new QuestionList(
                "Что из перечисленного не является характеристикой материи?",
                "Объективность",
                "Субъективность",
                "Познаваемость",
                "Структурность",
                "Субъективность",
                "");
        final QuestionList question7 = new QuestionList(
                "Кто из философов ввел термин \"философская антропология\"?",
                "Иоганн Готлиб Фихте",
                "Фридрих Вильгельм Йозеф фон Шеллинг",
                "Фридрих Гегель",
                "Иммануил Кант",
                "Иммануил Кант",
                "");
        final QuestionList question8 = new QuestionList(
                "Согласно какой гносеологической концепции, основу человеческого познания составляют иррациональные способности сознания (интуиция)?",
                "Синтетическая концепция",
                "Сенсуализм",
                "Эмпиризм",
                "Интуитивизм",
                "Интуитивизм",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой характеристике человеческого общества относится утверждение о способности эволюционировать или регрессировать?",
                "Самоорганизуемость",
                "Закономерность",
                "Динамичность",
                "Целостность",
                "Динамичность",
                "");
        final QuestionList question10 = new QuestionList(
                "Разработкой учения о 4-х первоначалах занимался...",
                "Платон",
                "Сократ",
                "Аристотель",
                "Пифагор",
                "Аристотель",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket5() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Предметом философии является...",
                "сознание",
                "совместная жизнь людей",
                "мир-человек",
                "назначение человека",
                "мир-человек",
                "");
        final QuestionList question2 = new QuestionList(
                "Теория единения максимальных и минимальных величин (человек является одновременно самым великим и самым малым во вселенной) принадлежит...",
                "Григорию Богослову",
                "Дж. Бруно",
                "Ансельму Кентерберийскому",
                "Фоме Аквинскому",
                "Дж. Бруно",
                "");
        final QuestionList question3 = new QuestionList(
                "Антимония - это...",
                "Логическое обоснование явления",
                "Свободный поток фантазии",
                "Синоним полемики",
                "Протеворечивые выводы разума",
                "Протеворечивые выводы разума",
                "");
        final QuestionList question4 = new QuestionList(
                "Суть перехода от классической к неклассической философии заключается в переходе...",
                "От модернизма к постмодернизму",
                "От рационализма к плюрализму",
                "От иррационализму к рационализму",
                "От рационализма к иррационализму",
                "От рационализма к иррационализму",
                "");
        final QuestionList question5 = new QuestionList(
                "На первое место в русской философии XIX в. выдвигаются проблемы...",
                "Социально-политические",
                "Диалектики",
                "Ценностей",
                "Экономические",
                "Социально-политические",
                "");
        final QuestionList question6 = new QuestionList(
                "Что из нижеперечисленного НЕ является одной из форм бытия?",
                "Природное",
                "Психическое",
                "Потенциальное",
                "Компьютерное",
                "Потенциальное",
                "");
        final QuestionList question7 = new QuestionList(
                "В каком значении понятие \"природа\" не используется в философии?",
                "Все существующее",
                "Естественная среда обитания человека",
                "Сущность вещей (их природа)",
                "Нетронутая человеком местность",
                "Нетронутая человеком местность",
                "");
        final QuestionList question8 = new QuestionList(
                "Какую форму не может принимать сознание?",
                "Общественную",
                "Историческую",
                "Объективную",
                "Индивидуальную",
                "Объективную",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой категории научной деятельности относятся гипотезы, теории и законы?",
                "Методы исследования",
                "Результаты научной деятельности",
                "Объект исследования",
                "Средства исследования",
                "Результаты научной деятельности",
                "");
        final QuestionList question10 = new QuestionList(
                "К какой сфере общественной жизни относится наука, образование и философия?",
                "Экономическая",
                "Политическая",
                "Социальная",
                "Духовная (культурная)",
                "Духовная (культурная)",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket6() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Что означает космоцентризм как основная характеристика античной философии?",
                "Поиск истины в диалоге",
                "Учение о 4-х первоначалах",
                "Идеи в качестве истинных и неизменных бытия",
                "Проблемы природы, космос в центре внимания",
                "Проблемы природы, космос в центре внимания",
                "");
        final QuestionList question2 = new QuestionList(
                "Что в философии эпохи Просвещения называли социальным оптимизмом?",
                "Идею всесильного разума",
                "Идею о полном политическом переустройстве",
                "Идею общественного прогресса",
                "Идею о переустройстве системы образования",
                "Идею общественного прогресса",
                "");
        final QuestionList question3 = new QuestionList(
                "Кто, помимо Карла Маркса, был вторым основателем Марксизма?",
                "Людвиг Фейербах",
                "Артур Шопенгауэр",
                "Фридрих Ницше",
                "Фридрих Энгельс",
                "Фридрих Энгельс",
                "");
        final QuestionList question4 = new QuestionList(
                "Первым этапом развития позитивизма в XIX - XX вв. стал...",
                "Классический позитивизм",
                "Неопозитивизм",
                "Постпозитивизм",
                "Эмпириокритицизм",
                "Классический позитивизм",
                "");
        final QuestionList question5 = new QuestionList(
                "Какой из нижеприведенных деятелей не относится к белорусской философии?",
                "Кирилл Туровский",
                "Сымон Будный",
                "Казимир Лыщинский",
                "Алексей Хомяков",
                "Алексей Хомяков",
                "");
        final QuestionList question6 = new QuestionList(
                "Концепция, рассматривающая пространство и время как особые самостоятельные сущности.",
                "Субъективная",
                "Реляционная",
                "Субстанциальная",
                "Относительная",
                "Субстанциальная",
                "");
        final QuestionList question7 = new QuestionList(
                "В какой из проекций человеческого бытия человек рассматривается как носитель уникальных свойств?",
                "Уникальность",
                "Индивид",
                "Личность",
                "Индивидуальность",
                "Индивидуальность",
                "");
        final QuestionList question8 = new QuestionList(
                "Какова основная идея конвенциональной концепции истины?",
                "Истина подкрепляется опытом",
                "Истина есть результат договора ученых",
                "Истина характеризуется непротиворечивостью",
                "Истинно то, что соответствует реальности",
                "Истина есть результат договора ученых",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой группе социальной структуры общества относятся жители города, деревни, области...?",
                "Этнические общности",
                "Социальные классы",
                "Социально-демографические группы",
                "Территориальные образования",
                "Территориальные образования",
                "");
        final QuestionList question10 = new QuestionList(
                "Основной идеей Эпикуреизма (школа Эллинистического периода древнегреческой философии) является...",
                "Стремление к наслаждению определяют счастье и добродетель",
                "Следование судьбе определяет счастье и добродетель",
                "Познавший многое не может придерживаться 1-й точки зрения",
                "Единое первоначало мира",
                "Стремление к наслаждению определяют счастье и добродетель",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket7() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Гносеология - это...", "Учение о познании",
                "Учение о практической человеческой деятельности",
                "Учение о ценностях человеческой жизни",
                "Учение о материальных ценностях",
                "Учение о познании",
                "");
        final QuestionList question2 = new QuestionList(
                "Что означает один из принципов средневекового философского мышления - креационизм?",
                "Бог является личностью, он уникален и вечен",
                "Идея об акте свободного творения мира Богом из ничего",
                "Судьба любой вещи или создания определено свыше",
                "История - осуществление Божественного замысла",
                "Идея об акте свободного творения мира Богом из ничего",
                "");
        final QuestionList question3 = new QuestionList(
                "Основной проблемой немецкой классической философии является...",
                "Отношение материи к сознанию",
                "Отношение духа к телу",
                "Проблема познаваемости мира",
                "Проблема познавательной активности субъекта",
                "Проблема познавательной активности субъекта",
                "");
        final QuestionList question4 = new QuestionList(
                "Предметом изучения экзистенциализма является...",
                "Человек",
                "Природа",
                "Бог",
                "Культура",
                "Человек",
                "");
        final QuestionList question5 = new QuestionList(
                "Что означает термин \"Гносеологический реализм\"?",
                "Существование субъективных миров",
                "Существование объективного мира",
                "Существование единой истины",
                "Связь философии с искусством",
                "Существование объективного мира",
                "");
        final QuestionList question6 = new QuestionList(
                "Онтология - это...",
                "Научное утверждение в философии",
                "Любое философское учение",
                "Религиозное учение",
                "Учение о бытии",
                "Учение о бытии",
                "");
        final QuestionList question7 = new QuestionList(
                "Экология - это наука о...",
                "Взаимодействиях организмов и их среде обитания",
                "Наука о защите природы",
                "Наука о загрязнении природы",
                "Наука о среде обитания организмов",
                "Взаимодействиях организмов и их среде обитания",
                "");
        final QuestionList question8 = new QuestionList(
                "Что из перечисленного не является вопросом философии относительно сознания?",
                "Отличия сознания от материальных явлений",
                "Атрибут человека или надчеловеческое явление?",
                "Соотношение сознания и близких понятий: душа, психика...",
                "Что первичнее: материя или сознание?",
                "Что первичнее: материя или сознание?",
                "");
        final QuestionList question9 = new QuestionList(
                "Что из перечисленного не входит в структуру научной деятельности?",
                "Результаты исследования",
                "Субъект исследования",
                "Длительность исследования",
                "Средства исследования",
                "Длительность исследования",
                "");
        final QuestionList question10 = new QuestionList(
                "Какая сфера общественной жизни является главной по мнению приверженцев марксистской философии?",
                "Духовная",
                "Социальная",
                "Политическая",
                "Экономическая",
                "Экономическая",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket8() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Наиболее тесную связь с мифологией и религией имела...",
                "Древнегреческая философия",
                "Древнекитайская философия",
                "Древнеиндийская философия",
                "Древнеримская философия",
                "Древнегреческая философия",
                "");
        final QuestionList question2 = new QuestionList(
                "Воинствующий атеизм в эпоху Просвещения характерен для...",
                "Деистов",
                "Представителей немецкого просвещения",
                "Английских материалистов",
                "Французских материалистов",
                "Французских материалистов",
                "");
        final QuestionList question3 = new QuestionList(
                "В чем заключалось изменение предмета философии в марксизме?",
                "Не только объяснения, но и служение обществу",
                "Отсутствие суждений на тему религии",
                "Обособление от философского наследия",
                "Природа в центре внимания",
                "Не только объяснения, но и служение обществу",
                "");
        final QuestionList question4 = new QuestionList(
                "Основоположником позитивизма стал...",
                "Томас Кун",
                "Карл Поппер",
                "Огюст Конт",
                "Иммануил Кант",
                "Огюст Конт",
                "");
        final QuestionList question5 = new QuestionList(
                "С какой особенностью национальной истории Беларуси связана неоднозначность термина \"Белорусская философия\"?",
                "Нахождение в составе разных государств",
                "Частота войн",
                "Медленно развивающаяся наука",
                "Поздняя отмена крепостного права",
                "Нахождение в составе разных государств",
                "");
        final QuestionList question6 = new QuestionList(
                "Что не является подходом в интерпретации пространства и времени?",
                "Биологический",
                "Объективный",
                "Психологический",
                "Социальный",
                "Объективный",
                "");
        final QuestionList question7 = new QuestionList(
                "Какой раздел философии занимается осмыслением феномена человека?",
                "Онтология",
                "Гносеология",
                "Философская антропология",
                "Социальная философия",
                "Философская антропология",
                "");
        final QuestionList question8 = new QuestionList(
                "Что из нижеперечисленного не является иррациональной способностью познания?",
                "Ясновидение",
                "Озарение",
                "Предчувствие",
                "Сравнение фактов",
                "Сравнение фактов",
                "");
        final QuestionList question9 = new QuestionList(
                "Что не изучается социальной философией?",
                "Сущность общества",
                "Закономерности общественного развития",
                "Закономерности общественной системы",
                "Эволюция философской мысли",
                "Эволюция философской мысли",
                "");
        final QuestionList question10 = new QuestionList(
                "К какому периоду древнегреческой философии относятся труды Сократа и Платона?",
                "Ранняя греческая философия",
                "Досократики",
                "Классический (5-4 вв. до н.э.)",
                "Эллинистический (римский) (4 в. до н.э. - 6 в. н.э.)",
                "Классический (5-4 вв. до н.э.)",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket9() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Первый этап развития материализма - ...",
                "Диалектический материализм Маркса и Энгельса",
                "Древнегреческий (античная Греция)",
                "Новое время (17-18 вв.)",
                "Древнекитайский",
                "Древнегреческий (античная Греция)",
                "");
        final QuestionList question2 = new QuestionList(
                "Патристика как период развития философии в Средневековье берет начало в...",
                "I в.",
                "II в.",
                "V в.",
                "VIII в.",
                "I в.",
                "");
        final QuestionList question3 = new QuestionList(
                "Рассудок по философии Канта - это...",
                "Форма внутреннего восприятия",
                "Врожденные знания совместно с опытом",
                "Способность обработки информации субъектом",
                "Подведение восприятия под единство языка",
                "Подведение восприятия под единство языка",
                "");
        final QuestionList question4 = new QuestionList(
                "Кто, по классификации людей Серена Кьеркегора, выбирает свой путь, не думая о чувстве долга и ответственности?",
                "Этик",
                "Эстетик",
                "Обыватель",
                "Религиозный человек",
                "Эстетик",
                "");
        final QuestionList question5 = new QuestionList(
                "C каким историческим событием в России связано начало развития русской философии?",
                "Отечественная война 1812 г.",
                "Отмена крепостного права",
                "Принятие христианства",
                "Восстание декабристов",
                "Принятие христианства",
                "");
        final QuestionList question6 = new QuestionList(
                "Термин \"онтология\" появился в...",
                "1513 г.",
                "1713 г.",
                "1613 г.",
                "1813 г.",
                "1613 г.",
                "");
        final QuestionList question7 = new QuestionList(
                "Автором концепции коэфолюции природы и общества является...",
                "Пьер Абеляр",
                "Беренгар Турский",
                "Николай Тимофеев-Ресовский",
                "Иоанн Росцелин",
                "Николай Тимофеев-Ресовский",
                "");
        final QuestionList question8 = new QuestionList(
                "Что из перечисленного не является инструментом формирования сознания человека?",
                "Естественная среда обитания",
                "Язык",
                "Наука",
                "Нормы поведения",
                "Естественная среда обитания",
                "");
        final QuestionList question9 = new QuestionList(
                "Что из перечисленного, согласно философии, не является фактором социокультурного статуса (роль, место, значение) науки?",
                "Доступность для масс",
                "Институциональность",
                "Инновационность",
                "Фундаментальность",
                "Доступность для масс",
                "");
        final QuestionList question10 = new QuestionList(
                "К какой сфере общественной жизни относится наука, образование и философия?",
                "Экономическая",
                "Политическая",
                "Социальная",
                "Духовная (культурная)",
                "Духовная (культурная)",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket10() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Пифагорейский союз относится к...",
                "Философии Древней Греции",
                "Философии Древнего Китая",
                "Философии Древней Индии",
                "Философии Древнего Рима",
                "Философии Древней Греции",
                "");
        final QuestionList question2 = new QuestionList(
                "Деизм - это",
                "Борьба с церковью",
                "Признание в качестве первопричины Бога",
                "Продвижение идей демократии",
                "Идея переустройства религии",
                "Признание в качестве первопричины Бога",
                "");
        final QuestionList question3 = new QuestionList(
                "В чем заключается материалистическое понимание истории (центральная идея марксизма)?",
                "История - предопределенный процесс",
                "Насилие - естественное состовляющее общества",
                "Иногда бытие определяет сознание, а не наоборот",
                "Окружающая среда определяет сознание",
                "Иногда бытие определяет сознание, а не наоборот",
                "");
        final QuestionList question4 = new QuestionList(
                "Процесс верификации фактов был предложен...",
                "Классическими позитивистами",
                "Постпозитивистами",
                "Неопозитивистами",
                "Эмпириокритицистами",
                "Неопозитивистами",
                "");
        final QuestionList question5 = new QuestionList(
                "Перевод Библии на старобелорусский язык осуществил...",
                "Симеон Полоцкий",
                "Кастусь Калиновский",
                "Франциск Скорина",
                "Лев Сапега",
                "Франциск Скорина",
                "");
        final QuestionList question6 = new QuestionList(
                "Что из перечисленного не является свойством материи?",
                "Движение",
                "Империативность",
                "Пространство",
                "Время",
                "Империативность",
                "");
        final QuestionList question7 = new QuestionList(
                "Какой из модусов (проекций) человеческого бытия также называют гуманистическим?",
                "Социальный",
                "Психический",
                "Биологический",
                "Духовный",
                "Духовный",
                "");
        final QuestionList question8 = new QuestionList(
                "Что означает позиция гносеологического оптимизма?",
                "Мир непознаваем",
                "Мир полностью познаваем",
                "Мир частично познаваем",
                "Мир практически непознаваем",
                "Мир полностью познаваем",
                "");
        final QuestionList question9 = new QuestionList(
                "Что из перечисленного не является характеристикой человеческого общества?",
                "Целостность",
                "Стабильность",
                "Институциональность",
                "Самоорганизуемость",
                "Стабильность",
                "");
        final QuestionList question10 = new QuestionList(
                "Идея о гармонии, объединяющая предметы с разными свойствами характерна...",
                "Китайской философии",
                "Греческой философии",
                "Индийской философии",
                "Римской философии",
                "Китайской философии",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket11() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Праксиология - это",
                "Учение  о познании",
                "Учение о практической человеческой деятельности",
                "Учение о возможностях разума в познании действительности",
                "Учение о возможностях чувств и ощущений в познании",
                "Учение о практической человеческой деятельности",
                "");
        final QuestionList question2 = new QuestionList(
                "Принцип \"Верую ибо абсурдно\" связан с...",
                "Апологетикой",
                "Зрелой Патристикой",
                "Поздней Патристикой",
                "Схоластикой",
                "Апологетикой",
                "");
        final QuestionList question3 = new QuestionList(
                "Кант сформулировал концепцию чистого разума как...",
                "Способность производить идеи, ценности, смыслы",
                "Способность восприятия информации",
                "Совокупный опыт субъекта",
                "Подведение восприятия под единство языка",
                "Способность производить идеи, ценности, смыслы",
                "");
        final QuestionList question4 = new QuestionList(
                "Фридрих Ницше, выступая против всего, что, по его мнению, сковывает жизнь, рассматривает ее через призму...",
                "Морали",
                "Религии",
                "Биологии",
                "Логики",
                "Биологии",
                "");
        final QuestionList question5 = new QuestionList(
                "В чем заключается одна из основных идей космизма?",
                "Единство разума и рассудка",
                "Единство мышления и быта",
                "Единство истины, добра и красоты",
                "Идея видения собственного мира индивидом",
                "Единство истины, добра и красоты",
                "");
        final QuestionList question6 = new QuestionList(
                "Согласно идеализму, первоосновой всего является...",
                "Бог",
                "Знание",
                "Материя",
                "Дух",
                "Дух",
                "");
        final QuestionList question7 = new QuestionList(
                "Что означает термин \"живая природа\"?",
                "Все существующее",
                "Естественная среда обитания человека, базис",
                "Загородная местность",
                "Сущность вещей (их природа)",
                "Естественная среда обитания человека, базис",
                "");
        final QuestionList question8 = new QuestionList(
                "На какой стадии истории интерпретации феномена сознание становится средством доказательства существования объективно-природного мира?",
                "Новое время",
                "Постклассическая философия\"",
                "Античность",
                "Средневековье",
                "Новое время",
                "");
        final QuestionList question9 = new QuestionList(
                "В какой период истории возникает наука как социальный институт?",
                "Постклассический",
                "Средневековье",
                "Возрождение",
                "Новое время",
                "Новое время",
                "");
        final QuestionList question10 = new QuestionList(
                "Что из перечисленного не является сферой общественной жизни?",
                "Политическая",
                "Историческая",
                "Социальная",
                "Духовная (культурная)",
                "Историческая",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket12() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Какому учению принадлежит утверждение \"Жизнь есть страдание\"?",
                "Джайнизм",
                "Буддизм",
                "Локаята",
                "Веданта",
                "Буддизм",
                "");
        final QuestionList question2 = new QuestionList(
                "Эпистемоцентризм - это...",
                "Первенство религии",
                "Первенство нравственности",
                "Первенство научного знания",
                "Первенство труда",
                "Первенство научного знания",
                "");
        final QuestionList question3 = new QuestionList(
                "По какой, по мнению Маркса, причине низы общества должны отказаться от частной собственности?",
                "Привязывает к одному месту, ограничивая развитие",
                "Служит порабощению одних людей над другими",
                "Лишние обязательства",
                "Зарабатывание на содержание, вместо саморазвития",
                "Служит порабощению одних людей над другими",
                "");
        final QuestionList question4 = new QuestionList(
                "Принцип \"Очищение опыта\" (пересмотр опыта, критика опыта) характерен для...",
                "Постпозитивизма",
                "Эмпириокритицизма",
                "Неопозитивизма",
                "Классического позитивизма",
                "Эмпириокритицизма",
                "");
        final QuestionList question5 = new QuestionList(
                "Белорусский институт философии при Национальной Академии Наук был открыт в...",
                "1931 году",
                "1901 году",
                "1921 году",
                "1951 году",
                "1931 году",
                "");
        final QuestionList question6 = new QuestionList(
                "Свойство субстанциональности материи означает...",
                "Вечность существования во времени",
                "Неуничтожимость",
                "Бесконечность в пространстве",
                "Саморазвитие",
                "Неуничтожимость",
                "");
        final QuestionList question7 = new QuestionList(
                "Антропогенез - это...",
                "Эволюция заболеваний",
                "Возрождение",
                "Процесс эволюции предшественников человека",
                "Эволюция любых биологических структур",
                "Процесс эволюции предшественников человека",
                "");
        final QuestionList question8 = new QuestionList(
                "Какой позиции в отношении познаваемости мира придерживался Иммануил Кант?",
                "Гносеологического оптимизма",
                "Гносеологического пессимизма",
                "Умеренного агностицизма",
                "Частичного агностицизма",
                "Гносеологического пессимизма",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой группе социальной структуры общества относится молодежь?",
                "Профессиональные группы",
                "Этнические общности",
                "Социально-демографические группы",
                "Социальные классы",
                "Социально-демографические группы",
                "");
        final QuestionList question10 = new QuestionList(
                "Пантеизм - это...",
                "Учение о неразрывности Бога и природы",
                "Совпадение бесконечного максимума и минимума",
                "Отказ от чувственных ориентаций",
                "Уподобление Богу в процессе познания мира",
                "Учение о неразрывности Бога и природы",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket13() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Функция систематизации философии заключается в...",
                "Выявлении обобщенных образов бытия человека",
                "Переводе знаний в логическую понятную форму",
                "Накоплении знаний",
                "Выражении суммарных результатов опыта",
                "Выражении суммарных результатов опыта",
                "");
        final QuestionList question2 = new QuestionList(
                "Теория множественности миров (каждая звезда - аналог Солнечной системы) продвигал...",
                "Н. Кузанский",
                "Гр. I Великий",
                "Дж. Бруно",
                "Аврелий Августин",
                "Дж. Бруно",
                "");
        final QuestionList question3 = new QuestionList(
                "Агностицизм - это...",
                "Учение о наличии врожденных познавательных форм",
                "Учение об определяющей важности опыта",
                "Учение о принципиальной непознаванемости вещей",
                "Идея врожденного ощущения личного бессмертия",
                "Учение о принципиальной непознаванемости вещей",
                "");
        final QuestionList question4 = new QuestionList(
                "Что, по Шопенгауэру, составляет подлинную сущность человека, является инструментом познания и выживания?",
                "Воля",
                "Разум",
                "Рассудок",
                "Физическая сила",
                "Воля",
                "");
        final QuestionList question5 = new QuestionList(
                "Доминантным философским течением в России на долгие годы стал...",
                "Неопозитивизм",
                "Идеализм",
                "Марксизм",
                "Материализм",
                "Марксизм",
                "");
        final QuestionList question6 = new QuestionList(
                "С какой точкой зрения из нижеприведенных связано решение проблем онтологии?",
                "Идеализм",
                "Гуманизм",
                "Дуализм",
                "Гностицизм",
                "Идеализм",
                "");
        final QuestionList question7 = new QuestionList(
                "В чем заключается термин \"нулевой рост экономики\" как способ решения экологических проблем?",
                "Переход на новые \"зеленые\" технологии производства",
                "Сокращение населения, сокращение производства",
                "Заморозка экономики на текущем уровне",
                "Рост экономики в установленном темпе",
                "Сокращение населения, сокращение производства",
                "");
        final QuestionList question8 = new QuestionList(
                "Какова связь между понятиями \"язык\" и \"сознание\"?",
                "Сознание без языка - лишь базовые знания",
                "Возможности сознания очень ограничены без языка",
                "Понятия взаимодополняют друг друга",
                "Связь отсутствует",
                "Возможности сознания очень ограничены без языка",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой категории научного знания относится философия?",
                "Социально-гуманитарные науки",
                "Технические науки",
                "Естественные науки",
                "Прикладные науки",
                "Социально-гуманитарные науки",
                "");
        final QuestionList question10 = new QuestionList(
                "Разработка практики молитвы стала итогом работы \"Исповедь\" философа...",
                "Аристотеля",
                "Яна Златоуса",
                "Фомы Аквинского",
                "Аврелия Августина",
                "Аврелия Августина",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket14() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "В древнеиндийской философии ведами называют...",
                "Обычаи, порядок, закон образа жизни",
                "Поток жизни, круговорот бытия",
                "Совершенных, гуманных людей",
                "Древние письменные источники",
                "Древние письменные источники",
                "");
        final QuestionList question2 = new QuestionList(
                "Антиклерикализмом в эпоху Просвещения называют...",
                "Стремление к политическому переустройству",
                "Идею о переустройстве системы образования",
                "Борьбу с церковью",
                "Переход общества к демократии",
                "Борьбу с церковью",
                "");
        final QuestionList question3 = new QuestionList(
                "В какой период времени складывается марксизм?",
                "30-е гг. XIX в.",
                "30-е гг. XX в.",
                "40-е гг. XIX в.",
                "40-е гг. XX в.",
                "40-е гг. XIX в.",
                "");
        final QuestionList question4 = new QuestionList(
                "\"Принцип логического позитивизма\" (научные открытия путем составления логических цепочек от данных фактов) характерен для...",
                "Постпозитивизма",
                "Неопозитивизма",
                "Эмпириокритицизма",
                "Постпозитивизма",
                "Неопозитивизма",
                "");
        final QuestionList question5 = new QuestionList(
                "Отличительной чертой белорусской философии является...",
                "Значимость религии",
                "Рассуждения на простые житейские темы",
                "Отражение культурно- политической истории",
                "Идеи материализма",
                "Отражение культурно- политической истории",
                "");
        final QuestionList question6 = new QuestionList(
                "Кто из философов выделил 5 форм движения материи?",
                "Фридрих Ницше",
                "Огюст Конт",
                "Карл Маркс",
                "Фридрих Энгельс",
                "Фридрих Энгельс",
                "");
        final QuestionList question7 = new QuestionList(
                "Главной целью философской антропологии является...",
                "Определить, что есть человек",
                "Найти смысл жизни человека",
                "Определить смысл разума человека",
                "Выявить последствия разума человека",
                "Определить, что есть человек",
                "");
        final QuestionList question8 = new QuestionList(
                "Согласно какой гносеологической концепции, основу человеческого познания составляет разум?",
                "Рационализм",
                "Эмпиризм",
                "Интуитивизм",
                "Сенсуализм",
                "Рационализм",
                "");
        final QuestionList question9 = new QuestionList(
                "Раздел философии, изучающий предельные основания общества как целостного явления, его закономерности и особенности, называется...",
                "Онтология",
                "Социальная философия",
                "Гносеология",
                "Философская антропология",
                "Социальная философия",
                "");
        final QuestionList question10 = new QuestionList(
                "Введенный Кантом термин \"категорический императив\" означает...",
                "Позитивные последствия разума человека",
                "Негативные последствия разума человека",
                "Базовые правила поведения человека",
                "Миссия человека в природе",
                "Базовые правила поведения человека",
                "");



        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket15() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Основная идея интуитивизма - ...",
                "нельзя понять сущности вещей",
                "мир познается с помощью интуиции",
                "мир познается с помощью чувств",
                "мир познается с помощью разума",
                "мир познается с помощью интуиции",
                "");
        final QuestionList question2 = new QuestionList(
                "Что стало опорой, предотвратившей ошибочные представления и заблуждения в религии?",
                "Учение Яна Златоуста",
                "Номинализм",
                "Концептуализм",
                "Библия",
                "Библия",
                "");
        final QuestionList question3 = new QuestionList(
                "Априоризм - это...",
                "Учение о наличии врожденных познавательных форм",
                "Идея о возможности полного отказа от метафизики",
                "Форма внутреннего восприятия субъектом",
                "Идея о невозможности постижения всего опытом",
                "Учение о наличии врожденных познавательных форм",
                "");
        final QuestionList question4 = new QuestionList(
                "Какой тип людей, по классификации Серена Кьеркегора, представляет собой стадию, на которую можно перейти после состояния отчаяния?",
                "Этик",
                "Эстетик",
                "Обыватель",
                "Религиозный человек",
                "Религиозный человек",
                "");
        final QuestionList question5 = new QuestionList(
                "Идеи марксизма проникли в Росиию...",
                "В первой половине 20 века",
                "Во второй половине 20 века",
                "Во второй половине 19 века",
                "В первой половине 19 века",
                "Во второй половине 19 века",
                "");
        final QuestionList question6 = new QuestionList(
                "Что из нижеперечисленного является одним из уровней бытия?",
                "Объективное",
                "Субъективное",
                "Потенциальное",
                "Прошлое",
                "Потенциальное",
                "");
        final QuestionList question7 = new QuestionList(
                "Как называют процесс становления человека?",
                "Арогенез",
                "Социогенез",
                "Аллогенез",
                "Катагенез",
                "Социогенез",
                "");
        final QuestionList question8 = new QuestionList(
                "К какому этапу классической западноевропейской философии относится суждение, что человек - творческая личность, \"прекрасный труд природы\"?",
                "Возрождение",
                "Новое время",
                "Постклассическая философия",
                "Средневековье",
                "Возрождение",
                "");
        final QuestionList question9 = new QuestionList(
                "В какую категорию структуры научной деятельности входят научные коллективы и отдельные ученые?",
                "Объект исследования",
                "Субъект исследования",
                "Методы исследования",
                "Результаты исследования",
                "Субъект исследования",
                "");
        final QuestionList question10 = new QuestionList(
                "Фактором антропогенеза не является...",
                "Окружающая среда",
                "Вера",
                "Мышление",
                "Речь",
                "Вера",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket16() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Единство противоположностей Инь и Ян относится к...",
                "Китайской философии",
                "Греческой философии",
                "Римской философии",
                "Индийской философии",
                "Китайской философии",
                "");
        final QuestionList question2 = new QuestionList(
                "Основной целью философии Нового времени является...",
                "Определение истинности религии",
                "Пересмотр уклада общества, поиск истинного",
                "Переопределение понятий нравственности и духовности",
                "Открытия, приносящие практическую пользу",
                "Открытия, приносящие практическую пользу",
                "");
        final QuestionList question3 = new QuestionList(
                "Что из перечисленного является видом познания / познавательных способностей?",
                "Иррациональное",
                "Пассивное",
                "Чувственное",
                "Постоянное",
                "Чувственное",
                "");
        final QuestionList question4 = new QuestionList(
                "Основным принципом позитивизма является утверждение, что несомненное знание может быть получено как результат сугубо...",
                "Научного познания",
                "Религиозного познания",
                "Логического познания",
                "Абстрактного философского познания",
                "Научного познания",
                "");
        final QuestionList question5 = new QuestionList(
                "С каким событием в истории связана институализация белорусской философии?",
                "Открытие БГУ (1921 г.)",
                "Закрытие Виленского университета (1832 г.)",
                "Вхождение в состав Российской империи",
                "Вхождение в состав СССР",
                "Открытие БГУ (1921 г.)",
                "");
        final QuestionList question6 = new QuestionList(
                "Подход в интерпретации пространства и времени, характеризующий смену дня и ночи.",
                "Психологический",
                "Биологический",
                "Социальный",
                "Объективный",
                "Биологический",
                "");
        final QuestionList question7 = new QuestionList(
                "Теория происхождения человека вследствие распространения внеземных форм жизни.",
                "Уфологическая",
                "Эволюционная",
                "Трудовая",
                "Религиозная",
                "Уфологическая",
                "");
        final QuestionList question8 = new QuestionList(
                "Что из перечисленного не является критерием истины?",
                "Общественное мнение",
                "Психология",
                "Эстетика",
                "Опыт",
                "Общественное мнение",
                "");
        final QuestionList question9 = new QuestionList(
                "Что является объектом изучения социальной философии?",
                "Человек как социальный субъект",
                "Человек как биологический субъект",
                "Общество",
                "Сознание",
                "Общество",
                "");
        final QuestionList question10 = new QuestionList(
                "Какая концепция истины является первой в истории философии?",
                "Когерентная",
                "Прагматическая",
                "Классическая",
                "Конвенциональная",
                "Классическая",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket17() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Выделяют 2 основные функции философии: ...",
                "Экспликации и рационализации",
                "Систематизации и интерпретации",
                "Мировоззренческую и методологическую",
                "культурно-воспитательную и интерпретационную",
                "Мировоззренческую и методологическую",
                "");
        final QuestionList question2 = new QuestionList(
                "Выберите автора, не относящегося к эпохе Возрождения.",
                "Рафаэль",
                "Шекспир",
                "Леонардо да Винчи",
                "Уильям Оккам",
                "Уильям Оккам",
                "");
        final QuestionList question3 = new QuestionList(
                "Первостепенная причина неизбежности антимоний - ...",
                "Выход разума за пределы компетенции",
                "Основание выводов на метафизических суждениях",
                "Непостижимость мира опытом",
                "Ограниченность познания каждого субъекта",
                "Непостижимость мира опытом",
                "");
        final QuestionList question4 = new QuestionList(
                "Артур Шопенгауэр считал себя подлинным наследником...",
                "Философии Шеллинга",
                "Философии Фейербаха",
                "Философии Гегеля",
                "Философии Канта",
                "Философии Канта",
                "");
        final QuestionList question5 = new QuestionList(
                "Какова основная идея прагматической концепции истины?",
                "Истинно то, что подкрепляется опытом",
                "Истина характеризуется непротиворечивостью",
                "Истина есть результат договора ученых",
                "Истина подкрепляется логическими выводами",
                "Истинно то, что подкрепляется опытом",
                "");
        final QuestionList question6 = new QuestionList(
                "Первым этапом развития материализма является...",
                "Диалектический материализм Маркса и Энгельса",
                "Античный",
                "Древнегреческий",
                "Древнекитайский",
                "Древнегреческий",
                "");
        final QuestionList question7 = new QuestionList(
                "К какому критерию истины относятся простота и привлекательность знания?",
                "Психологический",
                "Эстетический",
                "Теоретический",
                "Практический",
                "Эстетический",
                "");
        final QuestionList question8 = new QuestionList(
                "Какой из факторов социокультурного статуса (роль, место, значение) закрепляет науку на уровне социального института?",
                "Институциональность",
                "Фундаментальность",
                "Инновационность",
                "Вступительные барьеры отрасли",
                "Институциональность",
                "");
        final QuestionList question9 = new QuestionList(
                "Какая категория не входит в структуру научного знания?",
                "Естественные науки",
                "Наука обоснования",
                "Технические науки",
                "Социально-гуманитарные науки",
                "Наука обоснования",
                "");
        final QuestionList question10 = new QuestionList(
                "К какой категории научного знания относится познание космоса?",
                "Прикладные науки",
                "Естественные науки",
                "Социально-гуманитарные науки",
                "Технические науки",
                "Естественные науки",
                "");



        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket18() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Даршаны в древнеиндийской философии - это...",
                "Общее название совокупности философских школ",
                "Тайные учения",
                "Собрания текстов, отражающих мифологию",
                "Действия, определяющие судьбу любого существа",
                "Общее название совокупности философских школ",
                "");
        final QuestionList question2 = new QuestionList(
                "Какие 2 науки были главными в философском познании Нового времени?",
                "Химия, биология",
                "Физика, математика",
                "Математика, география",
                "Физика, астрономия",
                "Физика, математика",
                "");
        final QuestionList question3 = new QuestionList(
                "Что в философии называют предметом познания?",
                "Синоним объекта исследования",
                "Определенная сторона объекта исследования",
                "Совокупность всех свойств и граней объекта исследования",
                "Расширенная версия понятия объект исследования",
                "Определенная сторона объекта исследования",
                "");
        final QuestionList question4 = new QuestionList(
                "Какую основную проблему Конт видел в научном мире общества XIX века?",
                "Критически низкий уровень развития",
                "Отсутствие общего / целостности",
                "Слабая вовлеченность людей",
                "Неравномерное распределение усилий",
                "Отсутствие общего / целостности",
                "");
        final QuestionList question5 = new QuestionList(
                "Что в философии называют предметом познания?",
                "Синоним объекта исследования",
                "Определенная сторона объекта исследования",
                "Совокупность всех свойств и граней объекта исследования",
                "Расширенная версия понятия объект исследования",
                "Определенная сторона объекта исследования",
                "");
        final QuestionList question6 = new QuestionList(
                "Какой уровень организации движения материи является человекомерным / воспринимаемым человеком?",
                "Микро",
                "Макро",
                "Мегамир",
                "Средний",
                "Макро",
                "");
        final QuestionList question7 = new QuestionList(
                "Какому модусу (измерению) человеческого бытия характерно наличие мышления?",
                "Социальному",
                "Биологическому",
                "Психическому",
                "Духовному",
                "Психическому",
                "");
        final QuestionList question8 = new QuestionList(
                "Что означает позиция умеренного агностицизма?",
                "Мир частично познаваем",
                "Мир непознаваем",
                "Мир практически непознаваем",
                "Познаваемость мира варьируется",
                "Мир частично познаваем",
                "");
        final QuestionList question9 = new QuestionList(
                "Какой из вопросов социальной философии изучает особенности развития общества?",
                "Перспективы общественного развития",
                "Сущность общества",
                "Закономерности общественного развития",
                "Структура общества",
                "Закономерности общественного развития",
                "");
        final QuestionList question10 = new QuestionList(
                "Ситуация, когда существует необходимость теоретического объяснения фактов, в философии называется...",
                "Научная проблема",
                "Теория",
                "Идея",
                "Гипотеза",
                "Научная проблема",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    private static List<QuestionList> questions_ticket19() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Этический раздел философии - это...",
                "Учение о законах мышления",
                "Учение о морали, нравственности и добродетели",
                "Учение о происхождении народов",
                "Учение о совместной жизни людей",
                "Учение о морали, нравственности и добродетели",
                "");
        final QuestionList question2 = new QuestionList(
                "Первым периодом развития философии в эпоху Средневековья является...",
                "Апологетика",
                "Схоластика",
                "Патристика",
                "Зрелая Схоластика",
                "Патристика",
                "");
        final QuestionList question3 = new QuestionList(
                "Основоположником немецкой классической философии является...",
                "Фридрих Вильгельм Йозеф фон Шеллинг",
                "Иммануил Кант",
                "Иоганн Готлиб Фихте",
                "Жан-Жак Руссо",
                "Иммануил Кант",
                "");
        final QuestionList question4 = new QuestionList(
                "Фридрих Ницше является автором знаменитого выражения...",
                "\"Все течет, все меняется\"",
                "\"Что нас не убивает, делает нас сильнее\"",
                "\"Не было великого ума без примеси безумства\"",
                "\"Самый сильный тот, у кого есть сила управлять самим собой\"",
                "\"Что нас не убивает, делает нас сильнее\"",
                "");
        final QuestionList question5 = new QuestionList(
                "В какое время зарождается постнеклассическая наука?",
                "1-я половина XXI в.",
                "2-я половина XX в.",
                "Середина XIX в.",
                "2-я половина XVIII в.",
                "2-я половина XX в.",
                "");
        final QuestionList question6 = new QuestionList(
                "Какой из факторов социокультурного статуса (роль, место, значение) обеспечивает науку все большим влиянием в системе культуры?",
                "Доступность",
                "Институциональность",
                "Инновационность",
                "Фундаментальность",
                "Фундаментальность",
                "");
        final QuestionList question7 = new QuestionList(
                "Центральной темой какой онтологии является религия и сотворение мира Богом?",
                "Средневековая",
                "Античная",
                "Новое время",
                "Древняя",
                "Средневековая",
                "");
        final QuestionList question8 = new QuestionList(
                "Каким термином называют абстрактную догадку о сущности происходящих явлений без обоснований?",
                "Идея",
                "Гипотеза",
                "Теория",
                "Факт",
                "Идея",
                "");
        final QuestionList question9 = new QuestionList(
                "Какой этап развития науки из приведенных в истории философии является крайним?",
                "Классическая наука",
                "Протонаука",
                "Постнеклассическая наука",
                "Неклассическая наука",
                "Постнеклассическая наука",
                "");
        final QuestionList question10 = new QuestionList(
                "Каким термином обозначается качественная форма научного знания, существующая как система логически связанных предложений?",
                "Гипотеза",
                "Идея",
                "Теория",
                "Научная проблема",
                "Теория",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }

    private static List<QuestionList> questions_ticket20() {

        final List<QuestionList> questionList = new ArrayList<>();

        final QuestionList question1 = new QuestionList(
                "Наиболее высокого развития философская мысль достигла в...",
                "Древнем Риме",
                "Древней Индии",
                "Древней Греции",
                "Древнем Китае",
                "Древней Греции",
                "");
        final QuestionList question2 = new QuestionList(
                "Что является предметом философского познания Нового времени?",
                "Человек",
                "Бог",
                "Природа",
                "Устройство общества",
                "Природа",
                "");
        final QuestionList question3 = new QuestionList(
                "Какой этап развития науки из приведенных в истории философии является крайним?",
                "Классическая наука",
                "Протонаука",
                "Постнеклассическая наука",
                "Неклассическая наука",
                "Постнеклассическая наука",
                "");
        final QuestionList question4 = new QuestionList(
                "Завершающим этапом развития позитивизма в XIX - XX вв. является...",
                "Постпозитивизм",
                "Неопозитивизм",
                "Эмпириокритицизм",
                "Классический позитивизм",
                "Постпозитивизм",
                "");
        final QuestionList question5 = new QuestionList(
                "Какое основное отличие науки от искусства?",
                "Наука требует подготовки",
                "Наука отгораживается от субъективизма",
                "Наука формирует представление о эпохе",
                "Искусство использует категориальный аппарат",
                "Наука отгораживается от субъективизма",
                "");
        final QuestionList question6 = new QuestionList(
                "Формой бытия материи, характеризующей смену состояний объектов, последовательность процессов и их длительность, является...",
                "Пространство",
                "Движение",
                "Биосфера",
                "Время",
                "Время",
                "");
        final QuestionList question7 = new QuestionList(
                "К какому этапу классической западноевропейской философии относится суждение, что человек - существо, обладающее иррациональными импульсами?",
                "Античность",
                "Постклассическая философия",
                "Возрождение",
                "Новое время",
                "Постклассическая философия",
                "");
        final QuestionList question8 = new QuestionList(
                "Главной целью познания является...",
                "Накопление опыта",
                "Поиск истины",
                "Приспособленность к условиям среды",
                "Доминирование в обществе",
                "Поиск истины",
                "");
        final QuestionList question9 = new QuestionList(
                "К какой группе социальной структуры общества относятся рабочие, крестьяне, интеллигенция...?",
                "Социальные классы",
                "Этнические общности",
                "Социально-демографические группы",
                "Социокультурные группы",
                "Социальные классы",
                "");
        final QuestionList question10 = new QuestionList(
                "Каким термином называют абстрактную догадку о сущности происходящих явлений без обоснований?",
                "Идея",
                "Гипотеза",
                "Теория",
                "Факт",
                "Идея",
                "");


        questionList.add(question1);
        questionList.add(question2);
        questionList.add(question3);
        questionList.add(question4);
        questionList.add(question5);
        questionList.add(question6);
        questionList.add(question7);
        questionList.add(question8);
        questionList.add(question9);
        questionList.add(question10);
        return questionList;
    }


    public static List<QuestionList> getQuestions (String selectedTopicName) {
        switch(selectedTopicName) {
            case "Билет 1":
                return questions_ticket1();
            case "Билет 2":
                return questions_ticket2();
            case "Билет 3":
                return questions_ticket3();
            case "Билет 4":
                return questions_ticket4();
            case "Билет 5":
                return questions_ticket5();
            case "Билет 6":
                return questions_ticket6();
            case "Билет 7":
                return questions_ticket7();
            case "Билет 8":
                return questions_ticket8();
            case "Билет 9":
                return questions_ticket9();
            case "Билет 10":
                return questions_ticket10();
            case "Билет 11":
                return questions_ticket11();
            case "Билет 12":
                return questions_ticket12();
            case "Билет 13":
                return questions_ticket13();
            case "Билет 14":
                return questions_ticket14();
            case "Билет 15":
                return questions_ticket15();
            case "Билет 16":
                return questions_ticket16();
            case "Билет 17":
                return questions_ticket17();
            case "Билет 18":
                return questions_ticket18();
            case "Билет 19":
                return questions_ticket19();
            case "Билет 20":
                return questions_ticket20();
        }
        return questions_ticket1(); //нахер не надо, но компилятор попросил
    }

    public static List<QuestionList> getQuestionsSurvival (int ticketNum) {
        switch (ticketNum) {
            case 1:
                return questions_ticket1();
            case 2:
                return questions_ticket2();
            case 3:
                return questions_ticket3();
            case 4:
                return questions_ticket4();
            case 5:
                return questions_ticket5();
            case 6:
                return questions_ticket6();
            case 7:
                return questions_ticket7();
            case 8:
                return questions_ticket8();
            case 9:
                return questions_ticket9();
            case 10:
                return questions_ticket10();
            case 11:
                return questions_ticket11();
            case 12:
                return questions_ticket12();
            case 13:
                return questions_ticket13();
            case 14:
                return questions_ticket14();
            case 15:
                return questions_ticket15();
            case 16:
                return questions_ticket16();
            case 17:
                return questions_ticket17();
            case 18:
                return questions_ticket18();
            case 19:
                return questions_ticket19();
            case 20:
                return questions_ticket20();
        }
        return questions_ticket1();
    }


    public static String getActionbarTitle (String selectedTopicName) {
        switch(selectedTopicName) {
            case "Билет 1":
                return "Тренировка / Билет 1";
            case "Билет 2":
                return "Тренировка / Билет 2";
            case "Билет 3":
                return "Тренировка / Билет 3";
            case "Билет 4":
                return "Тренировка / Билет 4";
            case "Билет 5":
                return "Тренировка / Билет 5";
            case "Билет 6":
                return "Тренировка / Билет 6";
            case "Билет 7":
                return "Тренировка / Билет 7";
            case "Билет 8":
                return "Тренировка / Билет 8";
            case "Билет 9":
                return "Тренировка / Билет 9";
            case "Билет 10":
                return "Тренировка / Билет 10";
            case "Билет 11":
                return "Тренировка / Билет 11";
            case "Билет 12":
                return "Тренировка / Билет 12";
            case "Билет 13":
                return "Тренировка / Билет 13";
            case "Билет 14":
                return "Тренировка / Билет 14";
            case "Билет 15":
                return "Тренировка / Билет 15";
            case "Билет 16":
                return "Тренировка / Билет 16";
            case "Билет 17":
                return "Тренировка / Билет 17";
            case "Билет 18":
                return "Тренировка / Билет 18";
            case "Билет 19":
                return "Тренировка / Билет 19";
            case "Билет 20":
                return "Тренировка / Билет 20";
        }
        return "Тренировка по главам"; //нахер не надо, но компилятор попросил
    }

    public static String getActionbarTitleExams (String selectedTopicName) {
        switch(selectedTopicName) {
            case "Билет 1":
                return "Экзамен / Билет 1";
            case "Билет 2":
                return "Экзамен / Билет 2";
            case "Билет 3":
                return "Экзамен / Билет 3";
            case "Билет 4":
                return "Экзамен / Билет 4";
            case "Билет 5":
                return "Экзамен / Билет 5";
            case "Билет 6":
                return "Экзамен / Билет 6";
            case "Билет 7":
                return "Экзамен / Билет 7";
            case "Билет 8":
                return "Экзамен / Билет 8";
            case "Билет 9":
                return "Экзамен / Билет 9";
            case "Билет 10":
                return "Экзамен / Билет 10";
            case "Билет 11":
                return "Экзамен / Билет 11";
            case "Билет 12":
                return "Экзамен / Билет 12";
            case "Билет 13":
                return "Экзамен / Билет 13";
            case "Билет 14":
                return "Экзамен / Билет 14";
            case "Билет 15":
                return "Экзамен / Билет 15";
            case "Билет 16":
                return "Экзамен / Билет 16";
            case "Билет 17":
                return "Экзамен / Билет 17";
            case "Билет 18":
                return "Экзамен / Билет 18";
            case "Билет 19":
                return "Экзамен / Билет 19";
            case "Билет 20":
                return "Экзамен / Билет 20";
        }
        return "Тренировка по главам"; //нахер не надо, но компилятор попросил
    }

}
